#include "intro.h"
#include <iostream>
#include "fraction.h"

void intro() {
	// запуск демонстрації
	std::cout << "intro  to OOP" << std::endl;
	// створення об'єктів
	fraction_t frac1; // статичне оголошення - змінна у стеку
	fraction_t* frac2 = new fraction_t; // динамічне оголошення - об'єкт 
	//у "купи"
	std::cout 
		<< frac1.to_string() << std::endl // до об'єктів звертаємось через "."
		<< frac2->to_string() << std::endl; // до покажчиків - через "->"
	delete frac2;
}

/*
ООП. Вступ.
Парадигма - термін, що поєднує традиції, підходи, прийоми, методики тощо.
У програмуванні існують декілька парадигм:
- Імперативна парадигма (в яку входить процедурний підхід)
   програма вважається послідовністю інструкцій, серед яких лише одна
   виконується у даний момент часу. Окремі інструкції програми дозволяють
   змінювати порядок виконання (умови, цикли)
   Процедурний підхід - організація коду у вигяді набору процедур, тіла
   яких є послідовностями інструкцій
- Функціональна парадигма - базується на математично-функціональних засадах
   програма вважається "конвертом" у якому лежить інструкція, що слід 
   зробити, та новий "конверт" над яким слід виконати цю дію.
   Представники: LISP, Python, J, TCL, Haskel
- Декларативна парадигма (в яку входить логічна) - базується на теорії
знань
   програма складається за набору правил (аксіом) та твердження, яке 
   слід перевірити (теореми)
   Представник: Prolog (5 покоління)
- Об'єктно-орієнтована парадигма (ООП) - базується на принципах взаємодії
   Розроблялась як засіб описання еволюційних систем, у яких задаються 
   об'єкти та правила їх взаємодії. Суть програми - еволюція системи
   об'єктів.
   З точки зору практичного програмування вносить ідею колекцій - як 
   розвиток поняття масиву, але з можливістю змін розміру (через еволюцію -
   роботу програми)
   Представники ООП: C#, Java, прототипної підпарадигми: JavaScript,
   Python, PHP
*/
/*
Центральними поняттями ООП є "клас" та "об'єкт"
Клас - тип даних (аналогічний структурі), що дозволяє поєднувати інші типи
 даних, а також методи. Клас можна порівняти з "кресленням" за яким
 створюються
 об'єкти.
Об'єкт - це елемент (instance) класу.

*/